Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_csi.c
/****************************************************************************
 * apps/examples/camera_diag/esp32p4_csi.c
 *
 * S11-L1.6 camera build integration: minimal ESP32-P4 MIPI-CSI receive path
 * with DW-GDMA frame buffer (RAW8 1280x720). References:
 *   - esp-hal-3rdparty mipi_csi_hal/ll (built into the image, L1-A)
 *   - esp-hal-3rdparty dw_gdma_ll (channel 0, src=CSI bridge, dst=memory)
 *   - Espressif esp_cam_ctlr_csi.c DW-GDMA flow (contiguous P2M, src flow)
 *
 * Scope (per L1.6 authorization): CSI receive config, GDMA frame buffer,
 * timeout/cleanup, camera_diag metadata output. No ISP full pipeline,
 * no NuttX video/V4L2, no display preview, no image save, no algorithm.
 * Build-level integration only; no hardware operation performed.
 *
 * Controlled camera diagnostic; not real label inspection.
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>   /* up_udelay / up_enable_irq declarations */

#include <errno.h>
#include <stdio.h>
#include <debug.h>

#include "irq.h"        /* DW_GDMA_INTR_SOURCE / ESP_IRQ_DW_GDMA / ESP_SOURCE2IRQ */
#include "esp_irq.h"   /* esp_setup_irq / esp_teardown_irq / priorities */

#include "esp32p4_csi.h"
#include "esp32p4_csi_isp.h"
#include "esp32p4_dsi.h"
#include "camera_diag_gdma_plan.h"
#include "esp_ldo_regulator.h"
#include "esp_private/mipi_csi_share_hw_ctrl.h"

/* ESP-IDF RCC atomic-env helper shim: expands to the variable name that
 * callers declare before using the clock-gate ll wrappers (build-level). */
#define __DECLARE_RCC_ATOMIC_ENV rcc_atomic_env

#include "hal/mipi_csi_hal.h"
#include "hal/mipi_csi_ll.h"
#include "hal/mipi_csi_brg_ll.h"
#include "hal/mipi_csi_host_ll.h"
#include "hal/dw_gdma_ll.h"
#include "soc/reg_base.h"
#include "esp_cache.h"

/****************************************************************************
 * Private Data
 ****************************************************************************/

#define CSI_DMA_GROUP    0
#define CSI_DMA_CHANNEL  0

static mipi_csi_hal_context_t g_csi_hal;
static dw_gdma_dev_t *g_dma_dev;
static struct esp32p4_csi_config_s g_csi_cfg;

/* L1.8.14 F1: MIPI CSI/DSI PHY power LDO (channel 3, 2.5 V), required before
 * CSI bridge/PHY init (ESP-IDF mipi_isp_dsi example + test_csi_ov5647). */
#define CSI_MIPI_PHY_LDO_CHAN   3
#define CSI_MIPI_PHY_LDO_MV     2500
static esp_ldo_channel_handle_t g_csi_ldo;
static bool g_csi_ldo_acquired;

/* L1.8.25f R2: MIPI CSI bridge claim state (MIPI_CSI_BRG_USER_CSI). The
 * bridge MUST be claimed by the CSI controller BEFORE the ISP SHARE claim,
 * otherwise the ISP's first claim resets the bridge module clock and wipes
 * the configuration (burst_len=512/afull=960/data_type) back to reset
 * defaults (official success-path baseline, verified 3/3 on target). */
static bool g_csi_brg_claimed;
static int  g_csi_brg_id = -1;

/* L1.8.25f R3-P2: DW-GDMA block-done ISR state (ISP/RGB565 path only).
 * In SRC (bridge) flow-controller mode the GDMA block completes on the
 * bridge frame-boundary signal, NOT on the block_ts item count, and the
 * status0.cmpltd_blk_tfr_size read-back saturates (NuttX observed 960 =
 * MAX_BLK_SIZE) - so polling trans_amount >= frame_items can never succeed.
 * The fix registers a BLOCK_TFR_DONE interrupt; the ISR (interrupt context:
 * no logging/locks/libc) clears the event, bumps a volatile block counter
 * and re-arms the next block; the task context aggregates block completions
 * into whole RGB565 frames. */
static volatile uint32_t g_csi_block_count;    /* ISR-write, task-read */
/* L1.8.25f R4-D: cumulative actual completed items across block-done
 * events (sum of status0.cmpltd_blk_tfr_size readbacks). BLOCK_TFR_DONE
 * fires at bridge FIFO watermarks (960 items saturating), NOT at whole
 * frame size; a frame is complete only when the accumulated item count
 * reaches frame_items (153600 = 1228800 B / 8 B). */
static volatile uint32_t g_csi_frame_items_done; /* ISR-write, task-read */
/* L1.8.25f R3-P3 (read-only diag): ISR entry counter + last int_st0 seen by
 * the ISR, to distinguish "IRQ never routed" (entry_count==0) from
 * "block-done is a teardown artifact" (entry_count>0 but no block event). */
static volatile uint32_t g_csi_isr_entry_count;  /* every ISR entry */
static volatile uint32_t g_csi_isr_last_intr;    /* int_st0 snapshot in ISR */
static volatile bool     g_csi_block_armed;    /* ISR re-arm in progress */
static volatile uint32_t g_csi_isr_items;      /* per-block item count for re-arm */
static volatile uint32_t g_csi_isr_dst;        /* destination addr for re-arm */
static bool              g_csi_block_isr_attached; /* esp_setup_irq state */
static int               g_csi_block_cpuint = -1;   /* cpuint from esp_setup_irq */
static bool              g_csi_runtime_diag_enabled = true;
#define CSI_FRAME_BLOCKS_PER_FRAME 1u          /* legacy: frame completion now judged on g_csi_frame_items_done >= frame_items (153600), NOT on block-done count (R4-D) */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void esp32p4_csi_dma_channel_config(void)
{
  dw_gdma_dev_t *dev = g_dma_dev;
  uint8_t ch = CSI_DMA_CHANNEL;

  dw_gdma_ll_channel_set_trans_flow(dev, ch, DW_GDMA_ROLE_PERIPH_CSI,
                                    DW_GDMA_ROLE_MEM, DW_GDMA_FLOW_CTRL_SRC);
  dw_gdma_ll_channel_set_src_handshake_interface(dev, ch, DW_GDMA_HANDSHAKE_HW);
  dw_gdma_ll_channel_set_src_handshake_periph(dev, ch, DW_GDMA_ROLE_PERIPH_CSI);
  dw_gdma_ll_channel_set_dst_handshake_interface(dev, ch, DW_GDMA_HANDSHAKE_HW);

  dw_gdma_ll_channel_set_src_burst_mode(dev, ch, DW_GDMA_BURST_MODE_FIXED);
  dw_gdma_ll_channel_set_src_burst_items(dev, ch, DW_GDMA_BURST_ITEMS_512);
  dw_gdma_ll_channel_set_src_burst_len(dev, ch, 16);
  dw_gdma_ll_channel_set_src_trans_width(dev, ch, DW_GDMA_TRANS_WIDTH_64);

  dw_gdma_ll_channel_set_dst_burst_mode(dev, ch, DW_GDMA_BURST_MODE_INCREMENT);
  dw_gdma_ll_channel_set_dst_burst_items(dev, ch, DW_GDMA_BURST_ITEMS_512);
  dw_gdma_ll_channel_set_dst_burst_len(dev, ch, 16);
  dw_gdma_ll_channel_set_dst_trans_width(dev, ch, DW_GDMA_TRANS_WIDTH_64);

  dw_gdma_ll_channel_set_src_multi_block_type(dev, ch,
                                              DW_GDMA_BLOCK_TRANSFER_CONTIGUOUS);
  dw_gdma_ll_channel_set_dst_multi_block_type(dev, ch,
                                              DW_GDMA_BLOCK_TRANSFER_CONTIGUOUS);
  dw_gdma_ll_channel_set_src_outstanding_limit(dev, ch, 5);
  dw_gdma_ll_channel_set_dst_outstanding_limit(dev, ch, 5);
  dw_gdma_ll_channel_set_priority(dev, ch, 1);

  dw_gdma_ll_channel_set_src_master_port(dev, ch, MIPI_CSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_set_src_periph_status_addr(dev, ch, MIPI_CSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_enable_src_periph_status_write_back(dev, ch, true);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/* L1.8.8: CSI bridge/host init only (no GDMA). Used by --csi-runtime-diag so
 * the D1 (block size) / D2 (enable order) defects do not interfere with the
 * MIPI HS/PHY observation. */
int esp32p4_csi_brg_init(FAR const struct esp32p4_csi_config_s *cfg)
{
  mipi_csi_hal_config_t hal_cfg;
  esp_ldo_channel_config_t ldo_cfg;
  int rcc_atomic_env;          /* __DECLARE_RCC_ATOMIC_ENV shim */
  int ret;

  if (cfg == NULL)
    {
      return -EINVAL;
    }

  g_csi_cfg = *cfg;

  /* L1.8.25f R2: claim the MIPI CSI bridge as the CSI user FIRST, before
   * any bridge configuration. The official esp_cam_ctlr_csi.c does exactly
   * this (mipi_csi_brg_claim(MIPI_CSI_BRG_USER_CSI)); the ISP SHARE claim
   * then increments the ref-count WITHOUT resetting the bridge module
   * clock, so the configuration written below survives. Without this claim
   * the ISP's first claim runs mipi_csi_ll_reset_brg_module_clock() and
   * wipes burst_len=512/afull=960/data_type back to reset defaults (the
   * NuttX failure root cause, confirmed against the official 3/3 baseline).
   * Guarded by g_csi_brg_claimed to make repeated init idempotent. */
  if (!g_csi_brg_claimed)
    {
      int csi_brg_id = -1;
      ret = mipi_csi_brg_claim(MIPI_CSI_BRG_USER_CSI, &csi_brg_id);
      if (ret != OK)
        {
          i2cerr("csi: bridge claim (CSI) failed: %d\n", ret);
          return -EIO;
        }

      g_csi_brg_id = csi_brg_id;
      g_csi_brg_claimed = true;
    }

