Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_csi.c
  /* L1.8.14 F1: power up the MIPI CSI/DSI PHY before any CSI bridge/PHY
   * init (mirrors official ESP-IDF: esp_ldo_acquire_channel chan 3, 2.5 V).
   * On failure the CSI bridge claim is released symmetrically. */
  if (!g_csi_ldo_acquired)
    {
      memset(&ldo_cfg, 0, sizeof(ldo_cfg));
      ldo_cfg.chan_id    = CSI_MIPI_PHY_LDO_CHAN;
      ldo_cfg.voltage_mv = CSI_MIPI_PHY_LDO_MV;
      ret = esp_ldo_acquire_channel(&ldo_cfg, &g_csi_ldo);
      if (ret != OK)
        {
          if (g_csi_brg_claimed)
            {
              mipi_csi_brg_declaim(g_csi_brg_id);
              g_csi_brg_claimed = false;
              g_csi_brg_id = -1;
            }

          return -EIO;
        }

      g_csi_ldo_acquired = true;
    }

  /* Enable module clocks (bridge / phy config / host) */
  mipi_csi_ll_enable_brg_module_clock(0, true);
  mipi_csi_ll_reset_brg_module_clock(0);
  mipi_csi_ll_enable_phy_config_clock(0, true);
  _mipi_csi_ll_enable_host_bus_clock(0, true);
  mipi_csi_ll_reset_host_clock(0);

  hal_cfg.lanes_num         = cfg->lanes_num;
  hal_cfg.frame_width       = cfg->frame_height;  /* L1.8.21 D1: hal v_row_num uses frame_width -> height */
  hal_cfg.frame_height      = cfg->frame_width;   /* L1.8.21 D1: hal h_pixel_num uses frame_height -> width */
  hal_cfg.in_bpp            = cfg->in_bpp;
  hal_cfg.out_bpp           = cfg->out_bpp;
  hal_cfg.byte_swap_en      = cfg->byte_swap_en;
  hal_cfg.lane_bit_rate_mbps = cfg->lane_bit_rate_mbps;

  mipi_csi_hal_init(&g_csi_hal, &hal_cfg);

  /* CSI bridge: burst + clock + RAW8 bypass */
  mipi_csi_brg_ll_set_burst_len(g_csi_hal.bridge_dev, 512);
  mipi_csi_brg_ll_set_dma_req_interval(g_csi_hal.bridge_dev, 1);
  mipi_csi_brg_ll_set_color_mode_bypass(g_csi_hal.bridge_dev, true);
  mipi_csi_brg_ll_enable_clock(g_csi_hal.bridge_dev, true);

  return OK;
}

int esp32p4_csi_init(FAR const struct esp32p4_csi_config_s *cfg)
{
  int rcc_atomic_env;          /* __DECLARE_RCC_ATOMIC_ENV shim (dw_gdma_ll) */
  int ret;

  ret = esp32p4_csi_brg_init(cfg);
  if (ret != OK)
    {
      return ret;
    }

  /* DW-GDMA: clock, reset, controller, channel 0 = CSI P2M */
  g_dma_dev = DW_GDMA_LL_GET_HW(CSI_DMA_GROUP);
  if (g_dma_dev == NULL)
    {
      /* L1.8.25f R2: symmetric release of the bridge claim taken inside
       * esp32p4_csi_brg_init() before this failure is returned. */
      if (g_csi_brg_claimed)
        {
          mipi_csi_brg_declaim(g_csi_brg_id);
          g_csi_brg_claimed = false;
          g_csi_brg_id = -1;
        }

      /* L1.8.14 F1: release the MIPI PHY LDO on init failure. */
      if (g_csi_ldo_acquired)
        {
          esp_ldo_release_channel(g_csi_ldo);
          g_csi_ldo_acquired = false;
        }

      return -ENODEV;
    }

  dw_gdma_ll_enable_bus_clock(CSI_DMA_GROUP, true);
  dw_gdma_ll_reset_register(CSI_DMA_GROUP);
  dw_gdma_ll_reset(g_dma_dev);
  dw_gdma_ll_enable_controller(g_dma_dev, true);
  /* L1.8.25f R4-D: module-level global interrupt-output gate. Mirrors the
   * official dw_gdma_hal_init() third step (esp_hal_dma/dw_gdma_hal.c):
   * without cfg0.int_en=1 the GDMA interrupt signal never leaves the
   * module toward the INTC, so CLIC pending stays 0 and the ISR never
   * runs even though channel events are produced (R4-C clic_ip=0 root). */
  dw_gdma_ll_enable_intr_global(g_dma_dev, true);
  esp32p4_csi_dma_channel_config();

  i2cinfo("csi: lanes=%u %ux%u in_bpp=%u out_bpp=%u lane_rate=%d Mbps dma=ch%u\n",
          cfg->lanes_num, cfg->frame_width, cfg->frame_height,
          cfg->in_bpp, cfg->out_bpp, cfg->lane_bit_rate_mbps,
          CSI_DMA_CHANNEL);
  return OK;
}

int esp32p4_csi_enable(void)
{
  /* Bridge/dma enable happens per capture (see capture_one). */
  return OK;
}

/****************************************************************************
 * Name: esp32p4_csi_block_done_isr
 *
 * Description:
 *   L1.8.25f R3-P2: DW-GDMA BLOCK_TFR_DONE interrupt service routine
 *   (ISP/RGB565 path only). Interrupt context: NO logging, NO locks, NO
 *   libc. On a block-done event it clears the event bit, bumps the volatile
 *   block counter, and re-arms the next block (mirrors the official
 *   csi_dma_trans_done_callback re-arm: config_transfer + enable_ctrl(true)).
 *   With is_last=false the channel stays enabled; the task context decides
 *   when a full RGB565 frame (1 block = 153600 items) has completed.
 *
 * Returned Value:
 *   NuttX xcpt_t convention: 0 (no context switch requested).
 ****************************************************************************/

static int esp32p4_csi_block_done_isr(int irq, FAR void *arg, FAR void *context)
{
  dw_gdma_dev_t *dev = g_dma_dev;
  uint8_t ch = CSI_DMA_CHANNEL;
  uint32_t st;

  if (dev == NULL)
    {
      return 0;
    }

  st = dw_gdma_ll_channel_get_intr_status(dev, ch);
  /* ch0 (CSI) and ch1 (DSI) share DW_GDMA_INTR_SOURCE.  Service ch1 first
   * when a live DSI session is active; it only reads/clears channel 1 and
   * re-arms its own LLI. */
  esp32p4_dsi_gdma_irq_handler();
  g_csi_isr_entry_count++;          /* R3-P3: ISR entered (routing proof) */
  g_csi_isr_last_intr = st;         /* R3-P3: int_st0 as seen by the ISR */

  /* L1.8.25f R4-D2: clear ALL latched status bits on entry, mirroring the
   * official dw_gdma_channel_default_isr() (read full int_st0 -> clear all
   * -> dispatch). int_sig_ena0 defaults to all-ones, so non-BLOCK events
   * (SRC_TRANSCOMP etc.) also reach the CLIC once the module-level gate is
   * open; leaving them latched would keep the pending bit asserted and
   * re-trigger the ISR forever (interrupt storm -> UART stall / hang). */
  dw_gdma_ll_channel_clear_intr(dev, ch, st);

  if (st & DW_GDMA_LL_CHANNEL_EVENT_BLOCK_TFR_DONE)
    {
      g_csi_block_count++;

      /* L1.8.25f R4-D: accumulate the actual completed items of this block
       * (cmpltd_blk_tfr_size). Do NOT treat a single block-done as a frame:
       * with SRC flow-control the event fires at bridge FIFO watermarks
       * (960-item saturation), not at the 153600-item frame boundary. */
      g_csi_frame_items_done += dw_gdma_ll_channel_get_trans_amount(dev, ch);

      if (g_csi_block_armed)
        {
          /* Re-arm the next block: source = bridge FIFO, dst = current
           * frame buffer, same block size, is_last=false (keep draining). */
          dw_gdma_ll_channel_set_src_addr(dev, ch, MIPI_CSI_BRG_MEM_BASE);
          dw_gdma_ll_channel_set_dst_addr(dev, ch, g_csi_isr_dst);
          dw_gdma_ll_channel_set_dst_master_port(dev, ch, (intptr_t)g_csi_isr_dst);
          dw_gdma_ll_channel_set_trans_block_size(dev, ch, g_csi_isr_items);
          dw_gdma_ll_channel_set_block_markers(dev, ch, true, false, true);
          dw_gdma_ll_channel_enable(dev, ch, true);
        }
    }

