Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_csi.c
  return 0;
}

/****************************************************************************
 * Name: esp32p4_csi_install_block_isr
 *
 * Description:
 *   L1.8.25f R3-P2: install the DW-GDMA BLOCK_TFR_DONE interrupt for the
 *   ISP/RGB565 capture path. Called from task context (--isp-frame) after
 *   the ISP processor is enabled. Idempotent.
 *
 * Returned Value:
 *   OK (0) on success; negative errno on failure.
 ****************************************************************************/

int esp32p4_csi_install_block_isr(void)
{
  dw_gdma_dev_t *dev = g_dma_dev;
  uint8_t ch = CSI_DMA_CHANNEL;
  int ret;

  if (dev == NULL)
    {
      return -EINVAL;
    }

  if (g_csi_block_isr_attached)
    {
      return OK;
    }

  /* L1.8.25f R4-D2: narrow the interrupt masks to the completion events we
   * actually consume, mirroring the official dw_gdma_install_channel_
   * interrupt() + register_event_callbacks() flow:
   *   1) disable propagation of ALL channel events, clear all latched status,
   *   2) re-enable generation + propagation ONLY for BLOCK_TFR_DONE.
   * int_sig_ena0 defaults to all-ones, so without this narrowing every
   * non-completion event (SRC_TRANSCOMP, errors, ch_disabled/aborted) would
   * keep entering the CLIC and, with the module gate open (R4-D), re-trigger
   * the ISR in a storm even though the ISR now clears all latched bits. */
  dw_gdma_ll_channel_enable_intr_propagation(dev, ch, 0xffffffffu, false);
  dw_gdma_ll_channel_clear_intr(dev, ch, 0xffffffffu);

  dw_gdma_ll_channel_enable_intr_generation(dev, ch,
                                            DW_GDMA_LL_CHANNEL_EVENT_BLOCK_TFR_DONE,
                                            true);
  dw_gdma_ll_channel_enable_intr_propagation(dev, ch,
                                             DW_GDMA_LL_CHANNEL_EVENT_BLOCK_TFR_DONE,
                                             true);

  /* NuttX esp32p4 peripheral interrupts are dispatched through the
   * esp_isr_demultiplexing handler; the handler must be registered with
   * esp_setup_irq (NOT raw irq_attach - that leaves the cpuint unmapped and
   * up_enable_irq reports "IRQ not mapped"). esp_setup_irq allocates a CPU
   * interrupt and maps DW_GDMA_INTR_SOURCE to it. */
  ret = esp_setup_irq(DW_GDMA_INTR_SOURCE, ESP_IRQ_PRIORITY_DEFAULT,
                      ESP_IRQ_TRIGGER_LEVEL, esp32p4_csi_block_done_isr,
                      NULL);
  if (ret < 0)
    {
      i2cerr("csi: esp_setup_irq(DW_GDMA) failed: %d\n", ret);
      return -EIO;
    }

  g_csi_block_cpuint = ret;
  up_enable_irq(ESP_SOURCE2IRQ(DW_GDMA_INTR_SOURCE));
  g_csi_block_isr_attached = true;
  i2cinfo("csi: block-done ISR installed (source=%d cpuint=%d)\n",
          DW_GDMA_INTR_SOURCE, g_csi_block_cpuint);
  return OK;
}

void esp32p4_csi_set_runtime_diag(bool enabled)
{
  g_csi_runtime_diag_enabled = enabled;
}

int esp32p4_csi_disable(void)
{

  /* L1.8.25f R2: release the CSI bridge claim exactly once (idempotent).
   * ref_cnt: CSI claim (1) + ISP SHARE claim (1) = 2 -> this declaim makes
   * it 1; the ISP declaim (inside esp_isp_del_processor) makes it 0. For
   * the RAW8 path (no ISP) this single declaim brings 1 -> 0. Repeated
   * disable() calls are no-ops and never underflow the ref-count. */
  if (g_csi_brg_claimed)
    {
      mipi_csi_brg_declaim(g_csi_brg_id);
      g_csi_brg_claimed = false;
      g_csi_brg_id = -1;
    }

  /* L1.8.25f R3-P2: detach the block-done ISR (idempotent). */
  if (g_csi_block_isr_attached)
    {
      esp_teardown_irq(DW_GDMA_INTR_SOURCE, g_csi_block_cpuint);
      g_csi_block_isr_attached = false;
      g_csi_block_cpuint = -1;
      g_csi_block_count = 0;
      g_csi_frame_items_done = 0;
      g_csi_block_armed = false;
    }

  /* L1.8.14 F1: release the MIPI PHY LDO on the shutdown path. */
  if (g_csi_ldo_acquired)
    {
      esp_ldo_release_channel(g_csi_ldo);
      g_csi_ldo_acquired = false;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32p4_csi_brg_set_rgb565_out
 *
 * Description:
 *   L1.8.25e Stage B (ISP path): switch the CSI bridge data path to RGB565
 *   output. Mirrors the official esp_cam_ctlr_csi.c s_csi_ctlr_format_conversion
 *   for src==dst (RGB565 in/out): color conversion enabled, mode bypass set
 *   (input flows to output unchanged), both bridge input/output color formats
 *   set to RGB565. ISP keeps RAW8 input (demosaic to RGB565).
 *
 * Returned Value:
 *   OK (0) on success.
 ****************************************************************************/

int esp32p4_csi_brg_set_rgb565_out(void)
{
  /* Align with official: mipi_csi_brg_ll_enable_color_conversion(brg, true) is
   * set once at controller init; here we only configure the color format and
   * keep bypass (src == dst) per s_csi_ctlr_format_conversion. */
  mipi_csi_brg_ll_set_input_color_format(g_csi_hal.bridge_dev,
                                         CAM_CTLR_COLOR_RGB565);
  mipi_csi_brg_ll_set_output_color_format(g_csi_hal.bridge_dev,
                                          CAM_CTLR_COLOR_RGB565);
  mipi_csi_brg_ll_set_color_mode_bypass(g_csi_hal.bridge_dev, true);
  /* Official esp_cam_ctlr_csi.c:221 - color conversion enabled on the
   * bridge; bypass is set separately for the src==dst RGB565 path. */
  mipi_csi_brg_ll_enable_color_conversion(g_csi_hal.bridge_dev, true);

  i2cinfo("csi: bridge data path set to RGB565 (bypass, ISP output)\n");
  return OK;
}

/****************************************************************************
 * Name: esp32p4_csi_bridge_enable
 *
 * Description:
 *   Enable the MIPI CSI bridge once. In the ISP path this is done BEFORE
 *   the frame loop and the bridge stays enabled until the loop ends,
 *   mirroring the official esp_cam_ctlr_start lifecycle (the ISP reads
 *   RAW8 from the bridge continuously via mipi_data_en).
 *
 * Returned Value:
 *   OK (0).
 ****************************************************************************/

int esp32p4_csi_bridge_enable(void)
{
  mipi_csi_brg_ll_enable(g_csi_hal.bridge_dev, true);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_csi_bridge_disable
 *
 * Description:
 *   Disable the MIPI CSI bridge once, after the frame loop or on failure.
 *
 * Returned Value:
 *   OK (0).
 ****************************************************************************/

int esp32p4_csi_bridge_disable(void)
{
  mipi_csi_brg_ll_enable(g_csi_hal.bridge_dev, false);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_csi_isp_dump
 *
 * Description:
 *   L1.8.25e (ISP path, read-only runtime dump): dump the CSI bridge, host,
 *   DW-GDMA and ISP control register state. Used by --isp-frame at three
 *   points (after start / after first-frame timeout / before cleanup) to
 *   distinguish "CSI/ISP did not feed data into the bridge" from
 *   "bridge has data but the GDMA handshake did not advance".
 *   Read-only: no register is modified.
 *
 * Input Parameters:
 *   tag - Dump label printed as prefix (e.g. "START", "TIMEOUT", "CLEANUP").
 ****************************************************************************/

void esp32p4_csi_isp_dump(FAR const char *tag)
{
  csi_brg_dev_t *brg = g_csi_hal.bridge_dev;
  csi_host_dev_t *host = g_csi_hal.host_dev;
  dw_gdma_dev_t *dev = g_dma_dev;
  uint8_t ch = CSI_DMA_CHANNEL;
  uint32_t isp_cntl = esp32p4_csi_isp_get_cntl();

  /* ISP cntl register bit layout (soc/esp32p4 .../isp_struct.h):
   *   mipi_data_en bit0, isp_en bit1, isp_in_src bit[28:27],
   *   isp_out_type bit[31:29] (4 = RGB565). */
  printf("csi_dump[%s]: isp_cntl=0x%08lx (mipi_data_en=%u isp_en=%u "
         "in_src=%u out_type=%u)\n",
         tag, (unsigned long)isp_cntl,
         (unsigned int)((isp_cntl >> 0) & 0x1u),
         (unsigned int)((isp_cntl >> 1) & 0x1u),
         (unsigned int)((isp_cntl >> 27) & 0x3u),
         (unsigned int)((isp_cntl >> 29) & 0x7u));

  if (brg == NULL)
    {
      printf("csi_dump[%s]: bridge not initialized\n", tag);
      return;
    }

  printf("csi_dump[%s]: bridge en=%u clk=%u frame_cfg=0x%08lx dt=0x%08lx "
         "cm=0x%08lx bypass=%u burst_len=%lu req_int=%lu dmablk=%lu "
         "flow_ctrl=%u afull_thrd=%lu depth=%lu\n",
         tag,
         (unsigned int)brg->csi_en.csi_brg_en,
         (unsigned int)brg->host_ctrl.csi_enableclk,
         (unsigned long)brg->frame_cfg.val,
         (unsigned long)brg->data_type_cfg.val,
         (unsigned long)brg->host_cm_ctrl.val,
         (unsigned int)brg->host_cm_ctrl.csi_host_cm_bypass,
         (unsigned long)brg->dma_req_cfg.dma_burst_len,
         (unsigned long)brg->dma_req_interval.dma_req_interval,
         (unsigned long)brg->dmablk_size.dmablk_size,
         (unsigned int)brg->dma_req_cfg.csi_dma_flow_controller,
         (unsigned long)brg->buf_flow_ctl.csi_buf_afull_thrd,
         (unsigned long)brg->buf_flow_ctl.csi_buf_depth);

  printf("csi_dump[%s]: bridge int_raw=0x%08lx int_st=0x%08lx "
         "(vadr_gt=%u vadr_lt=%u discard=%u overrun=%u fifo_ovf=%u "
         "dma_upd=%u)\n",
         tag,
         (unsigned long)brg->int_raw.val,
         (unsigned long)brg->int_st.val,
         (unsigned int)brg->int_st.vadr_num_gt_int_st,
         (unsigned int)brg->int_st.vadr_num_lt_int_st,
         (unsigned int)brg->int_st.discard_int_st,
         (unsigned int)brg->int_st.csi_buf_overrun_int_st,
         (unsigned int)brg->int_st.csi_async_fifo_ovf_int_st,
         (unsigned int)brg->int_st.dma_cfg_has_updated_int_st);

  if (host == NULL)
    {
      printf("csi_dump[%s]: host not initialized\n", tag);
      return;
    }

  printf("csi_dump[%s]: host lanes=%u phy_rx=0x%08lx (clk_hs=%u "
         "ulpsesc0=%u ulpsesc1=%u) stopstate=0x%08lx (data0=%u data1=%u "
         "clk=%u)\n",
         tag,
         (unsigned int)host->n_lanes.n_lanes,
         (unsigned long)host->phy_rx.val,
         (unsigned int)host->phy_rx.phy_rxclkactivehs,
         (unsigned int)host->phy_rx.phy_rxulpsesc_0,
         (unsigned int)host->phy_rx.phy_rxulpsesc_1,
         (unsigned long)host->phy_stopstate.val,
         (unsigned int)host->phy_stopstate.phy_stopstatedata_0,
         (unsigned int)host->phy_stopstate.phy_stopstatedata_1,
         (unsigned int)host->phy_stopstate.phy_stopstateclk);

