Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_csi.c
  printf("csi_dump[%s]: host int_main=0x%08lx phy_fatal=0x%08lx "
         "pkt_fatal=0x%08lx bndry=0x%08lx seq=0x%08lx crc=0x%08lx "
         "pld_crc=0x%08lx data_id=0x%08lx ecc=0x%08lx phy=0x%08lx\n",
         tag,
         (unsigned long)host->int_st_main.val,
         (unsigned long)host->int_st_phy_fatal.val,
         (unsigned long)host->int_st_pkt_fatal.val,
         (unsigned long)host->int_st_bndry_frame_fatal.val,
         (unsigned long)host->int_st_seq_frame_fatal.val,
         (unsigned long)host->int_st_crc_frame_fatal.val,
         (unsigned long)host->int_st_pld_crc_fatal.val,
         (unsigned long)host->int_st_data_id.val,
         (unsigned long)host->int_st_ecc_corrected.val,
         (unsigned long)host->int_st_phy.val);

  if (dev == NULL)
    {
      printf("csi_dump[%s]: dma not initialized\n", tag);
      return;
    }

  /* ch0 enable bit is chen0.bit0 (ch1_en field name, bitpos [0]); the
   * channel is enabled by dw_gdma_ll_channel_enable writing 0x101<<ch. */
  printf("csi_dump[%s]: dma ch%u sar=0x%08lx dar=0x%08lx block_ts=0x%08lx "
         "status0=0x%08lx (cmpltd=%lu) intr=0x%08lx chen0=0x%08lx "
         "ch0_en=%u\n",
         tag,
         (unsigned int)ch,
         (unsigned long)dev->ch[ch].sar0.val,
         (unsigned long)dev->ch[ch].dar0.val,
         (unsigned long)dev->ch[ch].block_ts0.val,
         (unsigned long)dev->ch[ch].status0.val,
         (unsigned long)dw_gdma_ll_channel_get_trans_amount(dev, ch),
         (unsigned long)dw_gdma_ll_channel_get_intr_status(dev, ch),
         (unsigned long)dev->chen0.val,
         (unsigned int)((dev->chen0.val >> 0) & 0x1u));
}

/* L1.8.25f R4-B: abort-pre read-only snapshot (design ref:
 * l1825f-r4b-irq-enable-audit-20260815.md). All reads are volatile/MMIO
 * only; no writes, no IRQ change, no ESP_INTR_ENABLE, no CLIC write. */

static inline uint32_t r4b_read_clic_ie(int cpuint)
{
  /* CLIC per-interrupt control reg: DR_REG_CLIC_CTRL_BASE + (cpuint+16)*4,
   * IE bit = BIT(8) (soc/clic_reg.h). The +16 offset maps the external
   * interrupt number (0..31, as returned by esp_setup_irq) onto the CLIC
   * register space - matches rv_utils_intr_get_enabled_mask() and
   * esprv_int_set_vectored() which both use CLIC_EXT_INTR_NUM_OFFSET=16.
   * Read-only. */
  if (cpuint < 0)
    {
      return 0;
    }

  return (*(volatile uint32_t *)(0x20801000u + (uint32_t)(cpuint + 16) * 4u)) &
         (1u << 8);
}

static inline uint32_t r4b_read_mstatus_mie(void)
{
  uint32_t mstatus = 0;
  __asm__ volatile ("csrr %0, mstatus" : "=r"(mstatus));
  return (mstatus >> 3) & 1u;   /* MSTATUS_MIE = bit 3 */
}

/* L1.8.25f R4-C: read-only abort-pre snapshot augmentation. All reads are
 * volatile/MMIO only; no writes, no IRQ change, no CLIC write.
 *
 * Three new discriminating fields (see l1825f-r4c-demux-vector-audit):
 *  A) interrupt-matrix route value for DW_GDMA source 24:
 *     CORE0_GDMA_INT_MAP_REG = DR_REG_INTERRUPT_CORE0_BASE + 4*24
 *     = (DR_REG_HPPERIPH1_BASE 0x500C0000 + 0x16000 = 0x500D6000) + 0x60
 *     = 0x500D6060, field [5:0]. Expect 2 (=cpuint) if the route re-enable
 *     restored it; 6 (=INT_MUX_DISABLED_INTNO) if the INTRDISABLED disable
 *     route was never re-connected; 0 if never routed.
 *  B) CLIC pending (IP) bit of the external interrupt this source maps to:
 *     CLIC_INT_CTRL_REG(18) = 0x20801000 + 18*4 = 0x20801048, bit 0.
 *     Expect 1 if the GDMA event reached the CLIC input.
 *  C) NuttX reverse lookup: esp_cpuint_to_irq(cpuint, cpu) should return
 *     ESP_SOURCE2IRQ(24)=41 if esp_setup_irq registered the handle;
 *     esp_get_handle(cpu, irq) non-NULL proves the g_handle_map entry. */

static inline uint32_t r4c_read_intmtx_gdma_route(void)
{
  /* DR_REG_INTERRUPT_CORE0_BASE = DR_REG_INTR_BASE = 0x500D6000 */
  return (*(volatile uint32_t *)(0x500D6000u + 4u * 24u)) & 0x3fu;
}

static inline uint32_t r4c_read_clic_ip(int cpuint)
{
  if (cpuint < 0)
    {
      return 0;
    }

  /* CLIC_INT_CTRL_REG(cpuint + 16), IP bit = BIT(0). */
  return (*(volatile uint32_t *)(0x20801000u + (uint32_t)(cpuint + 16) * 4u)) &
         (1u << 0);
}

static void r4b_snapshot_abort_pre(void)
{
  dw_gdma_dev_t *dev = g_dma_dev;
  uint8_t ch = CSI_DMA_CHANNEL;
  uint32_t intr_st0    = dw_gdma_ll_channel_get_intr_status(dev, ch);
  uint32_t intr_sig    = dev->ch[ch].int_sig_ena0.val;
  uint32_t intr_st_ena = dev->ch[ch].int_st_ena0.val;
  uint32_t chen        = dev->chen0.val;
  uint32_t status0     = dev->ch[ch].status0.val;
  uint32_t clic_ie     = r4b_read_clic_ie(g_csi_block_cpuint);
  uint32_t mie         = r4b_read_mstatus_mie();

  /* R4-C: matrix route / CLIC pending / NuttX reverse lookup */
  uint32_t intmtx_route = r4c_read_intmtx_gdma_route();
  uint32_t clic_ip      = r4c_read_clic_ip(g_csi_block_cpuint);
  int      rev_irq      = esp_cpuint_to_irq(g_csi_block_cpuint, this_cpu());
  intr_handle_t h41     = esp_get_handle(this_cpu(), ESP_SOURCE2IRQ(DW_GDMA_INTR_SOURCE));

  printf("csi: abortpre intr_st0=0x%08lx sig_ena=0x%08lx st_ena=0x%08lx "
         "chen0=0x%08lx status0=0x%08lx clic_ie(cpuint=%d)=%lu mie=%lu "
         "isr_entry=%lu\n",
         (unsigned long)intr_st0,
         (unsigned long)intr_sig,
         (unsigned long)intr_st_ena,
         (unsigned long)chen,
         (unsigned long)status0,
         g_csi_block_cpuint,
         (unsigned long)clic_ie,
         (unsigned long)mie,
         (unsigned long)g_csi_isr_entry_count);

  printf("csi: r4c intmtx_gdma_route=0x%02lx (expect 0x02) "
         "clic_ip(cpuint=%d)=%lu (expect 1) "
         "rev_irq=%d (expect %d) handle41=%s\n",
         (unsigned long)intmtx_route,
         g_csi_block_cpuint,
         (unsigned long)clic_ip,
         rev_irq,
         (int)ESP_SOURCE2IRQ(DW_GDMA_INTR_SOURCE),
         h41 != NULL ? "yes" : "no");
}

/****************************************************************************
 * Name: esp32p4_csi_capture_one_rgb565
 *
 * Description:
 *   L1.8.25e Stage B (ISP path): capture one RGB565 frame into a PSRAM
 *   buffer. Frame size is fixed to width*height*2 B (RGB565) = 1,228,800 B
 *   for 1024x600; the 64-bit GDMA item count is derived via the existing
 *   camera_diag_gdma_frame_items_calc() (153,600 items). Polls trans_amount
 *   to the RGB565 item count (no interrupt callback in this first version).
 *   RAW8 path (esp32p4_csi_capture_one) is unchanged.
 *
 * Input Parameters:
 *   buffer        - Destination buffer (RGB565, PSRAM, 8 B aligned).
 *   buffer_length - Buffer size in bytes (must be >= frame_bytes).
 *   timestamp_ms  - Optional: capture timestamp in ms.
 *
 * Returned Value:
 *   Frame length in bytes on success; negative errno on failure.
 ****************************************************************************/

int esp32p4_csi_capture_one_rgb565(FAR uint8_t *buffer,
                                   size_t buffer_length,
                                   FAR uint32_t *timestamp_ms)
{
  dw_gdma_dev_t *dev = g_dma_dev;
  uint8_t ch = CSI_DMA_CHANNEL;
  uint32_t frame_items;
  uint32_t frame_bytes;
  uint32_t blocks_done = 0;
  int ret;
  int timeout;

  if (dev == NULL)
    {
      return -EINVAL;
    }

