Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_csi.c
  /* RGB565: 2 B per pixel. 1024x600 -> 1,228,800 B. */
  frame_bytes = (g_csi_cfg.frame_width * g_csi_cfg.frame_height * 16U) / 8U;

  ret = camera_diag_gdma_frame_items_calc(frame_bytes, &frame_items);
  if (ret == CSI_CALC_ERR_INVALID)
    {
      return -EINVAL;
    }

  if (ret == CSI_CALC_ERR_OVERFLOW)
    {
      return -EOVERFLOW;
    }

  if (ret != CSI_CALC_OK)
    {
      return ret;
    }

  if (buffer == NULL || buffer_length < frame_bytes)
    {
      return -EINVAL;
    }

  /* L1.8.25f R3-P2: program one contiguous block transfer (bridge FIFO ->
   * buffer). is_last=false keeps the channel enabled after each block-done
   * so the ISR can re-arm and the task loop can aggregate blocks into one
   * full RGB565 frame. */
  dw_gdma_ll_channel_set_src_addr(dev, ch, MIPI_CSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_set_dst_addr(dev, ch, (uint32_t)(uintptr_t)buffer);
  dw_gdma_ll_channel_set_dst_master_port(dev, ch, (intptr_t)buffer);
  dw_gdma_ll_channel_set_trans_block_size(dev, ch, frame_items);
  dw_gdma_ll_channel_set_block_markers(dev, ch, true, false, true);

  /* Arm the ISR re-arm parameters (task context) and reset the counters.
   * L1.8.25f R4-D: frame completion is judged on the CUMULATIVE completed
   * item count (g_csi_frame_items_done) reaching frame_items (153600),
   * not on the raw block-done event count (block events fire per 960-item
   * bridge FIFO watermark, which is NOT a whole frame). */
  g_csi_isr_items = frame_items;
  g_csi_isr_dst   = (uint32_t)(uintptr_t)buffer;
  g_csi_block_count = 0;
  g_csi_frame_items_done = 0;
  g_csi_block_armed = true;

  dw_gdma_ll_channel_clear_intr(dev, ch, 0xffffffffu);

  /* Invalidate the destination buffer before DMA writes (L1.7 cache policy),
   * full RGB565 frame size. */
  esp_cache_msync(buffer, frame_bytes,
                  ESP_CACHE_MSYNC_FLAG_DIR_M2C | ESP_CACHE_MSYNC_FLAG_INVALIDATE);

  /* L1.8.25e (ISP path): the CSI bridge is enabled ONCE by the caller
   * (esp32p4_csi_bridge_enable) before the frame loop and disabled once
   * after it. Here only the DMA channel is enabled per frame; bridge stays
   * on to keep the ISP data path alive (official start/stop lifecycle). */
  dw_gdma_ll_channel_enable(dev, ch, true);

  /* L1.8.25f R3-P2/R4-D: wait for a full RGB565 frame = frame_items
   * (153600) COMPLETED ITEMS accumulated in the ISR. Block-done events
   * fire at bridge FIFO watermarks (960 items), so a single block event
   * does NOT mean a whole frame; polling the cumulative item counter is
   * safe because it is a volatile counter, not the saturating cmpltd
   * read-back. */
  timeout = 500000;
  while (timeout-- > 0)
    {
      blocks_done = g_csi_block_count;
      if (g_csi_frame_items_done >= frame_items)
        {
          break;
        }

      up_udelay(10);
    }

  g_csi_block_armed = false;

  /* L1.8.25f R4-B: abort-pre read-only snapshot - BEFORE enable(false)/
   * abort(), to capture the raw pre-teardown state (int_st0 / sig_ena /
   * st_ena / chen0 / status0 / CLIC IE / mstatus.MIE / isr_entry). */
  if (g_csi_runtime_diag_enabled)
    {
      r4b_snapshot_abort_pre();
    }

  /* Timeout/cleanup path. Bridge is left enabled (caller disables once
   * after the frame loop). */
  dw_gdma_ll_channel_enable(dev, ch, false);
  dw_gdma_ll_channel_abort(dev, ch);

  if (g_csi_frame_items_done < frame_items)
    {
      /* L1.8.25f R3-P3/R4-D (read-only diag): distinguish "IRQ never
       * routed" (isr_entry==0) from "block-done is a teardown artifact"
       * (isr_entry>0 but no block event) and report how many of the
       * frame_items actually completed (cumulative items). */
      uint32_t cur_intr = dw_gdma_ll_channel_get_intr_status(dev, ch);
      printf("csi: rgb565 capture timeout (items_done=%lu need=%lu "
             "blocks=%lu isr_entry=%lu isr_last_intr=0x%08lx intr=0x%08lx "
             "chen0=0x%08lx)\n",
             (unsigned long)g_csi_frame_items_done,
             (unsigned long)frame_items,
             (unsigned long)blocks_done,
             (unsigned long)g_csi_isr_entry_count,
             (unsigned long)g_csi_isr_last_intr,
             (unsigned long)cur_intr,
             (unsigned long)dev->chen0.val);
      return -ETIMEDOUT;
    }

  esp_cache_msync(buffer, frame_bytes,
                  ESP_CACHE_MSYNC_FLAG_DIR_M2C | ESP_CACHE_MSYNC_FLAG_INVALIDATE);

  if (timestamp_ms != NULL)
    {
      *timestamp_ms = (uint32_t)((clock_systime_ticks() * 1000UL) /
                                 TICK_PER_SEC);
    }

  return (int)frame_bytes;
}
int esp32p4_csi_capture_one(FAR uint8_t *buffer, size_t buffer_length,
                            FAR uint32_t *timestamp_ms)
{
  dw_gdma_dev_t *dev = g_dma_dev;
  uint8_t ch = CSI_DMA_CHANNEL;
  uint32_t frame_items;
  uint32_t frame_bytes;
  uint32_t done = 0;
  int ret;
  int timeout;

  if (dev == NULL)
    {
      return -EINVAL;
    }

  frame_bytes = (g_csi_cfg.frame_width * g_csi_cfg.frame_height *
                 g_csi_cfg.in_bpp) / 8U;

  /* D1 (L1.8.11): DW_GDMA_TRANS_WIDTH_64 = 64 bit = 8 B per transfer item;
   * derive item count from frame bytes (never truncate, reject invalid). */
  ret = camera_diag_gdma_frame_items_calc(frame_bytes, &frame_items);
  if (ret == CSI_CALC_ERR_INVALID)
    {
      return -EINVAL;
    }

  if (ret == CSI_CALC_ERR_OVERFLOW)
    {
      return -EOVERFLOW;
    }

  if (ret != CSI_CALC_OK)
    {
      return ret;
    }

  if (buffer == NULL || buffer_length < frame_bytes)
    {
      return -EINVAL;
    }

  /* Program one contiguous block transfer: CSI bridge FIFO -> buffer */
  dw_gdma_ll_channel_set_src_addr(dev, ch, MIPI_CSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_set_dst_addr(dev, ch, (uint32_t)(uintptr_t)buffer);
  dw_gdma_ll_channel_set_dst_master_port(dev, ch, (intptr_t)buffer);
  dw_gdma_ll_channel_set_trans_block_size(dev, ch, frame_items);
  dw_gdma_ll_channel_set_block_markers(dev, ch, true, true, true);
  dw_gdma_ll_channel_clear_intr(dev, ch, 0xffffffffu);

  /* Invalidate the destination buffer before DMA writes (L1.7 cache policy) */
  esp_cache_msync(buffer, frame_bytes,
                  ESP_CACHE_MSYNC_FLAG_DIR_M2C | ESP_CACHE_MSYNC_FLAG_INVALIDATE);

