Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_csi.c
  /* D2 (L1.8.11): enable GDMA channel FIRST, then CSI bridge
   * (ESP-IDF esp_cam_ctlr_csi.c order). Matches csi_plan_start. */
  dw_gdma_ll_channel_enable(dev, ch, true);
  mipi_csi_brg_ll_enable(g_csi_hal.bridge_dev, true);

  timeout = 500000;
  while (timeout-- > 0)
    {
      done = dw_gdma_ll_channel_get_trans_amount(dev, ch);
      if (done >= frame_items)
        {
          break;
        }

      up_udelay(10);
    }

  /* Timeout/cleanup path */
  dw_gdma_ll_channel_enable(dev, ch, false);
  dw_gdma_ll_channel_abort(dev, ch);
  mipi_csi_brg_ll_enable(g_csi_hal.bridge_dev, false);

  if (done < frame_items)
    {
      i2cerr("csi: capture timeout (transferred %lu of %lu items)\n",
             (unsigned long)done, (unsigned long)frame_items);
      return -ETIMEDOUT;
    }

  /* Invalidate again so the CPU reads DMA-written data (L1.7 cache policy) */
  esp_cache_msync(buffer, frame_bytes,
                  ESP_CACHE_MSYNC_FLAG_DIR_M2C | ESP_CACHE_MSYNC_FLAG_INVALIDATE);

  if (timestamp_ms != NULL)
    {
      *timestamp_ms = (uint32_t)((clock_systime_ticks() * 1000UL) /
                                 TICK_PER_SEC);
    }

  return (int)frame_bytes;
}

/* L1.8.7: read-only CSI/GDMA register dump for first-frame-timeout diagnosis.
 * Prints CSI bridge, CSI host (incl. error interrupt status) and DW-GDMA
 * channel state. No enable/start/DMA operation is performed. */
int esp32p4_csi_diag(void)
{
  csi_brg_dev_t *brg = g_csi_hal.bridge_dev;
  csi_host_dev_t *host = g_csi_hal.host_dev;
  dw_gdma_dev_t *dev = g_dma_dev;
  uint8_t ch = CSI_DMA_CHANNEL;

  if (brg == NULL || host == NULL)
    {
      return -EINVAL;
    }

  printf("csi_diag: bridge en=%u clk=%u frame_cfg=0x%08lx dt=0x%08lx "
         "burst_len=%lu req_int=%lu bfc=0x%08lx endian=0x%08lx cm=0x%08lx\n",
         (unsigned int)brg->csi_en.csi_brg_en,
         (unsigned int)brg->host_ctrl.csi_enableclk,
         (unsigned long)brg->frame_cfg.val,
         (unsigned long)brg->data_type_cfg.val,
         (unsigned long)brg->dma_req_cfg.dma_burst_len,
         (unsigned long)brg->dma_req_interval.dma_req_interval,
         (unsigned long)brg->buf_flow_ctl.val,
         (unsigned long)brg->endian_mode.val,
         (unsigned long)brg->host_cm_ctrl.val);

  printf("csi_diag: host lanes=%u int_main=0x%08lx "
         "phy_fatal=0x%08lx pkt_fatal=0x%08lx bndry=0x%08lx seq=0x%08lx "
         "crc=0x%08lx pld_crc=0x%08lx data_id=0x%08lx ecc=0x%08lx phy=0x%08lx "
         "phy_rx=0x%08lx\n",
         (unsigned int)host->n_lanes.n_lanes,
         (unsigned long)host->int_st_main.val,
         (unsigned long)host->int_st_phy_fatal.val,
         (unsigned long)host->int_st_pkt_fatal.val,
         (unsigned long)host->int_st_bndry_frame_fatal.val,
         (unsigned long)host->int_st_seq_frame_fatal.val,
         (unsigned long)host->int_st_crc_frame_fatal.val,
         (unsigned long)host->int_st_pld_crc_fatal.val,
         (unsigned long)host->int_st_data_id.val,
         (unsigned long)host->int_st_ecc_corrected.val,
         (unsigned long)host->int_st_phy.val,
         (unsigned long)host->phy_rx.val);

  if (dev == NULL)
    {
      printf("csi_diag: dma not initialized (no GDMA in this mode)\n");
      return OK;
    }

  printf("csi_diag: dma ch%u sar=0x%08lx dar=0x%08lx block_ts=0x%08lx "
         "ctl0=0x%08lx ctl1=0x%08lx cfg0=0x%08lx cfg1=0x%08lx "
         "status0=0x%08lx intr=0x%08lx trans=%lu\n",
         (unsigned int)ch,
         (unsigned long)dev->ch[ch].sar0.val,
         (unsigned long)dev->ch[ch].dar0.val,
         (unsigned long)dev->ch[ch].block_ts0.val,
         (unsigned long)dev->ch[ch].ctl0.val,
         (unsigned long)dev->ch[ch].ctl1.val,
         (unsigned long)dev->ch[ch].cfg0.val,
         (unsigned long)dev->ch[ch].cfg1.val,
         (unsigned long)dev->ch[ch].status0.val,
         (unsigned long)dw_gdma_ll_channel_get_intr_status(dev, ch),
         (unsigned long)dw_gdma_ll_channel_get_trans_amount(dev, ch));

  return OK;
}


/* L1.8.17: read-only CSI data-plane diagnosis.
 * Enables the CSI bridge only (NO GDMA, NO frame capture), lets MIPI data
 * flow into the bridge FIFO for a fixed window, then dumps bridge FIFO
 * depth / bridge interrupt status (vadr gt/lt, discard, overrun, fifo
 * overflow, dma cfg updated), data-lane stop-state and CSI host error
 * interrupts. Disables the bridge before returning. Sensor stream-on/off
 * is handled by the caller (camera_diag --csi-data-diag). */
int esp32p4_csi_data_diag(void)
{
  csi_brg_dev_t *brg = g_csi_hal.bridge_dev;
  csi_host_dev_t *host = g_csi_hal.host_dev;

  if (brg == NULL || host == NULL)
    {
      return -EINVAL;
    }

  /* Enable bridge only; data may flow into the bridge FIFO, but no DMA
   * drains it. FIFO depth / overrun / discard evidence tells whether MIPI
   * data actually reaches the bridge (H1 data-plane check). */
  mipi_csi_brg_ll_enable(brg, true);

  /* Fixed observation window (matches runtime-diag) */
  up_udelay(500000);

  printf("csi_data: bridge en=%u clk=%u frame_cfg=0x%08lx dt=0x%08lx "
         "dma_req=0x%08lx flow_ctrl=%u burst_len=%lu dmablk=%lu req_int=%lu "
         "buf_flow=0x%08lx afull_thrd=%lu depth=%lu\n",
         (unsigned int)brg->csi_en.csi_brg_en,
         (unsigned int)brg->host_ctrl.csi_enableclk,
         (unsigned long)brg->frame_cfg.val,
         (unsigned long)brg->data_type_cfg.val,
         (unsigned long)brg->dma_req_cfg.val,
         (unsigned int)brg->dma_req_cfg.csi_dma_flow_controller,
         (unsigned long)brg->dma_req_cfg.dma_burst_len,
         (unsigned long)brg->dmablk_size.dmablk_size,
         (unsigned long)brg->dma_req_interval.dma_req_interval,
         (unsigned long)brg->buf_flow_ctl.val,
         (unsigned long)brg->buf_flow_ctl.csi_buf_afull_thrd,
         (unsigned long)brg->buf_flow_ctl.csi_buf_depth);

  printf("csi_data: bridge int_st=0x%08lx int_raw=0x%08lx "
         "(vadr_gt=%u vadr_lt=%u discard=%u overrun=%u fifo_ovf=%u dma_upd=%u)\n",
         (unsigned long)brg->int_st.val,
         (unsigned long)brg->int_raw.val,
         (unsigned int)brg->int_st.vadr_num_gt_int_st,
         (unsigned int)brg->int_st.vadr_num_lt_int_st,
         (unsigned int)brg->int_st.discard_int_st,
         (unsigned int)brg->int_st.csi_buf_overrun_int_st,
         (unsigned int)brg->int_st.csi_async_fifo_ovf_int_st,
         (unsigned int)brg->int_st.dma_cfg_has_updated_int_st);

  printf("csi_data: host lanes=%u phy_rx=0x%08lx (clk_hs=%u ulpsesc0=%u ulpsesc1=%u) "
         "stopstate=0x%08lx (data0=%u data1=%u clk=%u)\n",
         (unsigned int)host->n_lanes.n_lanes,
         (unsigned long)host->phy_rx.val,
         (unsigned int)host->phy_rx.phy_rxclkactivehs,
         (unsigned int)host->phy_rx.phy_rxulpsesc_0,
         (unsigned int)host->phy_rx.phy_rxulpsesc_1,
         (unsigned long)host->phy_stopstate.val,
         (unsigned int)host->phy_stopstate.phy_stopstatedata_0,
         (unsigned int)host->phy_stopstate.phy_stopstatedata_1,
         (unsigned int)host->phy_stopstate.phy_stopstateclk);

  printf("csi_data: host int_main=0x%08lx err phy_fatal=0x%08lx pkt_fatal=0x%08lx "
         "bndry=0x%08lx seq=0x%08lx crc=0x%08lx pld_crc=0x%08lx "
         "data_id=0x%08lx ecc=0x%08lx phy=0x%08lx\n",
         (unsigned long)host->int_st_main.val,
         (unsigned long)host->int_st_phy_fatal.val,
         (unsigned long)host->int_st_pkt_fatal.val,
         (unsigned long)host->int_st_bndry_frame_fatal.val,
         (unsigned long)host->int_st_seq_frame_fatal.val,
         (unsigned long)host->int_st_crc_frame_fatal.val,
         (unsigned long)host->int_st_pld_crc_fatal.val,
         (unsigned long)host->int_st_data_id.val,
         (unsigned long)host->int_st_ecc_corrected.val,
         (unsigned long)host->int_st_phy.val);

  mipi_csi_brg_ll_enable(brg, false);
  return OK;
}
